
// import Card from './script/card.js';
import CardList from './script/cardlist.js';
import main from './script/script.js';

new CardList();
main();

import './style.css';

/*
 * Другое дело, видно что Вы стараетесь
 * Ожидал что увижу что-то плохое, но Вы оказались красавчиком ;)
 * Чистый код, такие работы повышают настроение )
 * Что надо сделать: Ничего, проблем не нашёл
 * 
 * Мне очень понравилось что настройки вынесены отдельно это я про  options
 * Можно лучше: Файлы которые являются классами, обычно пишутся с большой буквы, это общепринятая практика 
 * Можно лучше: Вынесите все названия в отдельный модуль допустим lang в виде объекта. Представьте, что вас попросили добавить второй язык )
 * 
 */